---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPartDueToWallJoin
source: html/13763b00-d031-a7f9-46d2-034946a815bd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPartDueToWallJoin Property

Failed to create basic layer geometry due to an excessively short edge created by wall join.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldNotCreateWallPartDueToWallJoin { get; }
```